---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.TransactionFailed
source: html/e4a84352-02de-220f-842b-25fded4f56fb.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.TransactionFailed Property

[Description]

## Syntax (C#)
```csharp
public static FailureDefinitionId TransactionFailed { get; }
```